Repository: aschnell/barrel
Catalog: po/*.po
Languages: sv

source: %d bits
sv: %d bitar

source: Activate BitLocker %1$s on %2$s (%3$s) with UUID %4$s...
sv: Aktivera BitLocker %1$s på %2$s (%3$s) med UUID %4$s...

source: Activate BitLocker on %1$s (%2$s) with UUID %3$s...
sv: Aktivera Bitlocker på %1$s (%2$s) med UUID %3$s...

source: Activate LUKS %1$s on %2$s (%3$s) with UUID %4$s...
sv: Aktivera LUKS %1$s på %2$s (%3$s) med UUID %4$s...

source: Activate LUKS on %1$s (%2$s) with UUID %3$s...
sv: Aktivera LUKS på %1$s (%2$s) med UUID%3$s...

source: Activating...
sv: Aktiverar...

source: Adds devices to a pool.
sv: Lägger till enheter i en pool.

source: Alias for 'create encryption --type luks1'
sv: Alias för 'create encryption --type luks1'

source: Alias for 'create encryption --type luks2'
sv: Alias för 'create encryption --type luks2'

source: Alias for 'create filesystem --type bcachefs'
sv: Alias för 'create filesystem --type bcachefs'

source: Alias for 'create filesystem --type btrfs'
sv: Alias för 'create filesystem --type btrfs'

source: Alias for 'create filesystem --type exfat'
sv: Alias för 'create filesystem --type exfat'

source: Alias for 'create filesystem --type ext2'
sv: Alias för 'create filesystem --type ext2'

source: Alias for 'create filesystem --type ext3'
sv: Alias för 'create filesystem --type ext3'

source: Alias for 'create filesystem --type ext4'
sv: Alias för 'create filesystem --type ext4'

source: Alias for 'create filesystem --type f2fs'
sv: Alias för 'create filesystem --type f2fs'

source: Alias for 'create filesystem --type jfs'
sv: Alias för 'create filesystem --type jfs'

source: Alias for 'create filesystem --type nilfs2'
sv: Alias för 'create filesystem --type nilfs2'

source: Alias for 'create filesystem --type ntfs'
sv: Alias för 'create filesystem --type ntfs'

source: Alias for 'create filesystem --type reiserfs'
sv: Alias för 'create filesystem --type reiserfs'

source: Alias for 'create filesystem --type swap'
sv: Alias för 'create filesystem --type swap'

source: Alias for 'create filesystem --type udf'
sv: Alias för 'create filesystem --type udf'

source: Alias for 'create filesystem --type vfat'
sv: Alias för 'create filesystem --type vfat'

source: Alias for 'create filesystem --type xfs'
sv: Alias för 'create filesystem --type xfs'

source: Alias for 'create partition-table --type gpt'
sv: Alias för 'create partition-table --type gpt'

source: Alias for 'create partition-table --type ms-dos'
sv: Alias för 'create partition-table --type ms-dos'

source: Alias for 'create raid --level 0'
sv: Alias för 'create raid --level 0'

source: Alias for 'create raid --level 1'
sv: Alias för 'create raid --level 1'

source: Alias for 'create raid --level 10'
sv: Alias för 'create raid --level 10'

source: Alias for 'create raid --level 4'
sv: Alias för 'create raid --level 4'

source: Alias for 'create raid --level 5'
sv: Alias för 'create raid --level 5'

source: Alias for 'create raid --level 6'
sv: Alias för 'create raid --level 6'

source: Block Size
sv: Blockstorlek

source: Bus ID
sv: Buss-ID

source: Chunk Size
sv: Klumpstorlek

source: Cipher
sv: Chiffer

source: Clears the stack.
sv: Rensar stacken.

source: Commands:
sv: Kommandon:

source: Commit changes?
sv: Skicka in ändringar?

source: Commits changes to disk and quits barrel.
sv: Begår ändringar på disk och avslutar barrel.

source: Continue?
sv: Fortsätt?

source: Creates a new LVM logical volume.
sv: Skapar en ny LVM logisk-volym.

source: Creates a new LVM volume group.
sv: Skapar en ny LVM volym-grupp.

source: Creates a new RAID.
sv: Skapar en ny RAID.

source: Creates a new encryption device.
sv: Skapar en ny krypteringsenhet.

source: Creates a new file system.
sv: Skapar ett nytt filsystem.

source: Creates a new partition table.
sv: Skapar en ny partitionstabell.

source: Creates a new pool containing devices.
sv: Skapar en ny pool som innehåller enheter.

source: Description
sv: Beskrivning

source: Device '%s' cannot be resized.
sv: Enhet '%s' kan inte ändra storlek.

source: Devices
sv: Enheter

source: Duplicates the top object of the stack.
sv: Duplicerar det översta objektet i stacken.

source: Enter password:
sv: Ange lösenord:

source: Exchanges the top two elements of the stack.
sv: Byter ut de två översta elementen i stacken.

source: Extent Size
sv: Omfattning Storlek

source: GPT on %s
sv: GPT på %s

source: Generating pools
sv: Genererar pooler

source: Global options:
sv: Globala alternativ:

source: Invalid answer '%s'
sv: Ogiltigt svar '%s'

source: Invalid table style '%s'.
sv: Ogiltig tabell-stil '%s'.

source: Keep smiling, 'cause that's the most important thing.
sv: Fortsätt le, för det är det viktigaste.

source: Key File
sv: Nyckelfil

source: Key Size
sv: Nyckelstorlek

source: LUKS on %s
sv: LUKS på %s

source: LVM logical volume %s
sv: LVM logisk-volym %s

source: LVM volume group %s
sv: LVM volym-grupp %s

source: Label
sv: Etikett

source: Level
sv: Nivå

source: Loading pools...
sv: Laddar pooler...

source: Loads pools.
sv: Laddar pooler.

source: Loads the staging devicegraph from a file.
sv: Laddar uppsättningsenhetsgrafen från en fil.

source: MS-DOS on %s
sv: MS-DOS på %s

source: Missing argument for command option '%s'.
sv: Saknas argument för kommandoalternativ '%s'.

source: Missing argument for global option '%s'.
sv: Saknas argument för globalt alternativ '%s'.

source: Missing block devices.
sv: Saknar blockenheter.

source: Missing size option.
sv: Saknar storleksalternativ.

source: Model
sv: Modell

source: Mount Point
sv: Monteringspunkt

source: Name
sv: Namn

source: New size too big.
sv: Ny storlek för stor.

source: New size too small.
sv: Ny storlek för liten.

source: No block devices allowed for command option '%s'.
sv: Inga blockenheter tillåtna för kommandoalternativet '%s'.

source: No global block devices allowed.
sv: Inga globala blockenheter tillåts.

source: Passwords do not match.
sv: Lösenorden matchar inte.

source: Prints help.
sv: Skriver ut hjälp.

source: Prints the stack.
sv: Skriver ut stacken.

source: Probing...
sv: Sonderar...

source: Profiles
sv: Profiler

source: Quit?
sv: Avsluta?

source: Quits barrel.
sv: Avslutar barrel.

source: RAID level already set for command 'raid'
sv: RAID-nivå redan inställd för kommandot 'raid'

source: Raid level missing for command 'raid'
sv: Raidnivå saknas för kommandot "raid"

source: Removes a device.
sv: Tar bort en enhet.

source: Removes a pool.
sv: Tar bort en pool.

source: Removes devices from a pool.
sv: Tar bort enheter från en pool.

source: Removes the top object from the stack.
sv: Tar bort det översta föremålet från stacken.

source: Renames pool.
sv: Byter namn på pool.

source: Resizes a device.
sv: Ändrar storlek på en enhet.

source: Restores the staging devicegraph to the last backup.
sv: Återställer iscensättningsenhetsgrafen till den senaste säkerhetskopian.

source: Save pools
sv: Spara pooler

source: Saves pools.
sv: Sparar pooler.

source: Saves the devicegraph to a file.
sv: Sparar enhetsgrafen till en fil.

source: Saving pools...
sv: Sparar pooler...

source: Setting id of partition %s from unsupported value to %s.
sv: Ställer in id av en partition %s från värde som inte stöds till %s.

source: Shows DASDs.
sv: Visar DASD:er.

source: Shows LVM volume groups.
sv: Visar LVM volym-grupper.

source: Shows RAIDs.
sv: Visar RAIDer.

source: Shows actiongraph.
sv: Visar actiongraf.

source: Shows commit actions.
sv: Visar commit åtgärder.

source: Shows device tree.
sv: Visar enhetsträd.

source: Shows devicegraph.
sv: Visar enhetsgraf.

source: Shows disks.
sv: Visar diskar.

source: Shows encryption devices.
sv: Visar krypteringsenheter.

source: Shows filesystems.
sv: Visar filsystem.

source: Shows multipath devices.
sv: Visar flersökvägsenheter.

source: Shows pools.
sv: Visar pooler.

source: Size
sv: Storlek

source: Stripes
sv: Ränder

source: The command has the following subcommands:
sv: Kommandot har följande underkommandon:

source: Type
sv: Typ

source: Unknown global option '%s'.
sv: Okänt globalt alternativ '%s'.

source: Unknown option '%s' for command '%s'.
sv: Okänt alternativ '%s' för kommando '%s'.

source: Usage
sv: Användningsområde

source: Use an integer number from %d to %d.
sv: Använd ett heltal från %d till %d.

source: Used
sv: Används

source: Vendor
sv: Tillverkare

source: Verify password:
sv: Bekräfta lösenord:

source: [ pushes a mark on the stack.
sv: [ trycker på ett märke på stacken.

source: ] constructs an array.
sv: ] konstruerar en array.

source: activate by
sv: aktivera genom att

source: activate options
sv: aktiveringsalternativ

source: activate storage systems at startup
sv: aktivera lagringssystem vid uppstart

source: activate-by label requires a label
sv: aktivera-genom-etikett kräver en etikett

source: answer all questions with yes
sv: svara på alla frågor med ja

source: array with %d object
sv: array med %d objekt

source: bad devices argument
sv: argument för dåliga enheter

source: bad stripes argument
sv: dåliga strimmla argument

source: be more verbose
sv: var mer omfattande

source: be quiet
sv: var tyst

source: block device '%s' cannot be removed
sv: blockenhet '%s' kan inte tas bort

source: block device '%s' cannot be used as a regular block device
sv: blockenhet '%s' kan inte användas som en vanlig blockenhet

source: block device '%s' is in use
sv: blockenhet '%s' används redan

source: block devices for LVM volume group missing
sv: blockenheter för LVM-volymgrupp saknas

source: block devices for RAID missing
sv: block enheter för RAID saknas

source: block devices for filesystem missing
sv: block enheter för filsystem saknas

source: block devices missing for command 'raid'
sv: blockenheter saknas för kommando 'raid'

source: close for json file '%s' failed
sv: stängning av json-fil '%s' misslyckades

source: closing json file '%s' failed
sv: stängning av json-fil '%s' misslyckades

source: deleted device
sv: enheten togs bort

source: device '%s' not found in mapping
sv: enhet '%s' hittades inte i mappningen

source: do not add in /etc/crypttab
sv: lägg inte till i /etc/crypttab

source: do not add in /etc/fstab
sv: lägg inte till i /etc/fstab

source: do not add in /etc/mdadm.conf
sv: lägg inte till i /etc/mdadm.conf

source: do not commit anything to disk
sv: skriv inte något till disken

source: do not show colors
sv: visa inte färger

source: do not show partitions on DASDs
sv: visa inte partitioner på DASD:er

source: do not show partitions on RAIDs
sv: visa inte partitioner på RAIDer

source: do not show partitions on disks
sv: visa inte partitioner på diskar

source: do not show partitions on multipath devices
sv: visa inte partitioner på flersökvägsenheter

source: done
sv: klar

source: element of array for '%s' not string
sv: element i array för '%s' är inte en sträng

source: element of devices array for '%s' not string
sv: element av enhets-array för '%s' är inte en sträng

source: encryption type
sv: typ av kryptering

source: encryption type already set for command 'encryption'
sv: krypteringstyp redan inställd för kommandot 'encryption'

source: encryption type missing for command 'encryption'
sv: krypteringstyp saknas för kommandot 'encryption'

source: error:
sv: fel:

source: excessive content in json file '%s'
sv: överdrivet innehåll i json-fil '%s'

source: failed to calculate actions
sv: misslyckades med att beräkna åtgärder

source: failed to parse size '%s'
sv: misslyckades med att analysera storlek '%s'

source: filesystem %s on %s
sv: filsystem %s på %s

source: filesystem type already set for command 'filesystem'
sv: filsystemstyp redan inställd för kommandot 'filesystem'

source: filesystem type missing for command 'filesystem'
sv: filsystemstyp saknas för kommandot 'filesystem'

source: force if block device is in use
sv: tvinga om blockenhet redan används

source: force if block devices are in use
sv: tvinga om blockenhet redan används

source: go downwards
sv: gå nerför

source: go upwards
sv: gå uppför

source: invalid devices value '%d'
sv: ogiltigt enhetsvärde '%d'

source: invalid logical volume name for command 'lv'
sv: ogiltigt logiskt volymnamn för kommandot 'lv'

source: invalid path '%s'
sv: ogiltig sökväg '%s'

source: invalid size '%s'
sv: ogiltig storlek '%s'

source: invalid volume group name for command 'vg'
sv: ogiltigt volymgruppnamn för kommandot 'vg'

source: keep underlying partitions
sv: behåll underliggande partitioner

source: label only supported for LUKS2
sv: etikett stöds endast för LUKS2

source: mapped DASD for '%s' has different format
sv: mappad DASD för '%s' har ett annat format

source: mapped DASD for '%s' has different type
sv: mappad DASD för '%s' har en annan typ

source: mapped DASD for '%s' mapped twice
sv: mappad DASD för '%s' mappad två gånger

source: mapped DM RAID for '%s' mapped twice
sv: mappad DM RAID för '%s' mappad två gånger

source: mapped device for '%s' has different block size
sv: mappad enhet för '%s' har en annan blockstorlek

source: mapped device for '%s' is not a DASD
sv: mappad enhet för '%s' är inte en DASD

source: mapped device for '%s' is not a DM RAID
sv: mappad enhet för '%s' är inte en DM-RAID

source: mapped device for '%s' is not a disk
sv: mappad enhet för '%s' är inte en disk

source: mapped device for '%s' is not a multipath
sv: mappad enhet för '%s' är inte en multipelsökväg

source: mapped device for '%s' is smaller
sv: mappad enhet för '%s' är mindre

source: mapped device for '%s' not found
sv: mappad enhet för '%s' hittades inte

source: mapped disk for '%s' mapped twice
sv: mappad disk för '%s' mappad två gånger

source: mapped multipath for '%s' mapped twice
sv: mappad multipelsökväg för '%s' mappad två gånger

source: mapping %s to %s
sv: mappar %s till %s

source: mapping not found in json file '%s'
sv: mappning hittades inte i json-fil '%s'

source: missing block device
sv: saknar blockenhet

source: missing partitionable
sv: saknas partitionerbar

source: mkfs options
sv: mkfs alternativ

source: mount by
sv: monterad av

source: mount options
sv: monteringsalternativ

source: mount options require a path
sv: monteringsalternativ kräver en sökväg

source: mount path
sv: monteringssökväg

source: mount-by label requires a label
sv: montera-med-etikett kräver en etikett

source: mount-by requires a path
sv: montera-med kräver en sökväg

source: multiple devices
sv: multipla enheter

source: name missing for command 'devicegraph'
sv: namn saknas för kommandot 'devicegraph'

source: name missing for command 'encryption'
sv: namn saknas för kommandot 'encryption'

source: name missing for command 'lv'
sv: namn saknas för kommandot 'lv'

source: name missing for command 'vg'
sv: namn saknas för kommandot 'vg'

source: name of RAID already exists
sv: namnet på RAID finns redan

source: name of devicegraph
sv: namn på enhetsgraf

source: name of devicegraph file
sv: namn på enhetsgraf-fil

source: name of encryption already exists
sv: namn på krypteringen finns redan

source: name of logical volume already exists
sv: namn på den logiska volymen finns redan

source: name of mapping file
sv: namn på mappningsfilen

source: name of new pool
sv: namn på ny pool

source: name of pool
sv: namn på pool

source: name of pool to use
sv: namn på pool att använda

source: name of volume group
sv: namn på volymgrupp

source: name of volume group already exists
sv: namn på volymgruppen finns redan

source: neither + nor - allowed in size
sv: varken + eller - tillåtna i storlek

source: new name
sv: nytt namn

source: new size
sv: ny storlek

source: no backup available for undo
sv: ingen säkerhetskopia tillgänglig för ångra

source: no mapping DASD for '%s' found
sv: ingen mappnings-DASD för '%s' hittades

source: no mapping DM RAID for '%s' found
sv: ingen mappning av DM RAID för '%s' hittades

source: no mapping disk for '%s' found
sv: ingen mappningsdisk för '%s' hittades

source: no mapping multipath for '%s' found
sv: ingen flervägssökvägsmappning för '%s' hittades

source: no mark on stack
sv: ingen markering på stack

source: not a block device in array
sv: inte en blockenhet i array

source: not a block device on stack
sv: inte en blockenhet på stack

source: not a block device or array of block devices on stack
sv: inte en blockenhet eller array av blockenheter på stack

source: not a device in array
sv: inte en enhet i array

source: not a device on stack
sv: inte en enhet på stack

source: not a partition table in array
sv: inte en partitionstabell i array

source: not a partition table on stack
sv: inte en partitionstabell på stack

source: not a partition table or array of partition tables on stack
sv: inte en partitionstabell eller array av partitionstabeller på stack

source: not a partitionable
sv: inte en partitionerbar

source: not a partitionable on stack
sv: inte en partitionerbar på stack

source: not a volume group on stack
sv: inte en volymgrupp på stack

source: number of stripes
sv: nummer av strimmlor

source: old name
sv: gammalt namn

source: only one block device allowed
sv: endast en blockenhet tillåten

source: only one partition table allowed
sv: endast en partitionstabell tillåts

source: only one partitionable allowed
sv: endast en partitionerbar tillåten

source: open for json file '%s' failed
sv: öppna för json-fil '%s' misslyckades

source: opening json file '%s' failed
sv: öppnande av json-fil '%s' misslyckades

source: option --devices not allowed for %s
sv: alternativet --devices är inte tillåtna för %s

source: parsing json file '%s' failed
sv: analysera json-fil '%s' misslyckades

source: partition table type
sv: typ av partitionstabell

source: partition table type already set command 'partition-table'
sv: partitionstabelltyp redan satt med kommandot 'partition-table'

source: partition table type missing for command 'partition-table'
sv: partitionstabellstyp saknas för kommandot 'partition-table'

source: partitionable '%s' cannot be used as a regular partitionable
sv: partitionerbar '%s' kan inte användas som en vanlig partitionerbar

source: partitionable '%s' is in use
sv: partitionerbar '%s' används redan

source: path '%s' already used
sv: sökväg '%s' har redan använts

source: path must be 'swap' or 'none'
sv: sökvägen måste vara 'swap' eller 'none'

source: pool argument and blk devices not allowed together for command 'encryption'
sv: poolargument och blk-enheter är inte tillåtna tillsammans för kommandot 'encryption'

source: pool argument and blk devices not allowed together for command 'filesystem'
sv: poolargument och blk-enheter är inte tillåtna tillsammans för kommandot 'filesystem'

source: pool argument and blk devices not allowed together for command 'vg'
sv: poolargument och blk-enheter är inte tillåtna tillsammans för kommandot 'vg'

source: pool is empty
sv: pool är tom

source: pool name
sv: pool namn

source: probe used space
sv: upptäck använt utrymme

source: read for json file '%s' failed
sv: läsning av json-fil '%s' misslyckades

source: run with a rootprefix
sv: kör med ett rootprefix

source: set PBKDF
sv: ställ in PBKDF

source: set RAID level
sv: ställ in RAID-nivå

source: set RAID metadata version
sv: ställ in RAID-metadataversion

source: set RAID name
sv: ställ in RAID-namn

source: set a key file
sv: ställ in en nyckel-fil

source: set chunk size
sv: ställ in klump storlek

source: set cipher
sv: ställ in chiffer

source: set extent size
sv: ställ in omfattningsstorlek

source: set file system label
sv: ställ in filsystemetikett

source: set file system type
sv: ställ in filsystemstyp

source: set key size
sv: ställ in nyckelstorlek

source: set label of device
sv: ställ in etiketten för enhet

source: set name of device
sv: ställ in namn på enhet

source: set name of logical volume
sv: ställ in namnet på den logiska volymen

source: set name of volume group
sv: ställ in namnet på volymgrupp

source: set number of devices
sv: ställ in antalet enheter

source: set profiles
sv: ställ in profiler

source: set size
sv: ställ in storlek

source: set size of RAID
sv: ställ in storlek på RAID

source: set size of logical volume
sv: ställ in storlek på logisk-volym

source: set size of volume group
sv: ställ in storlek på volymgrupp

source: several mapping DASDs for '%s' found
sv: flera mappnings-DASD:er för '%s' hittades

source: several mapping DM RAIDs for '%s' found
sv: flera mappnings-DM-RAID för '%s' hittades

source: several mapping disks for '%s' found
sv: flera mappningsdiskar för '%s' hittade

source: several mapping multipath for '%s' found
sv: flera flervägsmappningar för '%s' hittades

source: show colors
sv: visa färger

source: show condensed instead of detailed actions
sv: visa komprimerade istället för detaljerade åtgärder

source: show help and exit
sv: visa hjälp och avsluta

source: show version and exit
sv: visa version och avsluta

source: size argument missing for command 'encryption'
sv: storleksargument saknas för kommandot 'encryption'

source: size argument missing for command 'filesystem'
sv: storleksargument saknas för kommandot 'filesystem'

source: size argument required for command 'raid'
sv: storleksargument krävs för kommandot 'raid'

source: size argument required for command 'vg'
sv: storleksargument krävs för kommandot 'vg'

source: size missing for command 'lv'
sv: storlek saknas för kommandot 'lv'

source: size of stripes
sv: storlek av strimmlor

source: spare devices not allowed for raid level
sv: reservenheter är inte tillåtna för raidnivå

source: stack empty
sv: stack tom

source: stack empty during dup
sv: stack tom vid dup

source: stack empty during pop
sv: stack tom vid pop

source: stackunderflow during exch
sv: stackunderflow vid utbyte

source: stat for json file '%s' failed
sv: statistik för json-fil '%s' misslyckades

source: table style
sv: tabellstil

source: too few raid devices for raid level
sv: för få raidenheter för raidnivå

source: tune options
sv: tune alternativ

source: tune options not allowed for %s
sv: tune alternativ inte tillåtna för %s

source: unknown activate-by type '%s'
sv: okänd aktivera-efter-typ '%s'

source: unknown btrfs profile '%s'
sv: okänd btrfs profil '%s'

source: unknown encryption type
sv: okänd krypteringstyp

source: unknown filesystem type '%s'
sv: okänd filsystemtyp '%s'

source: unknown mount-by type '%s'
sv: okänd montera-efter-typ '%s'

source: unknown partition table type
sv: okänd partitionstabellstyp

source: unknown probe-used-space mode '%s'
sv: okänd kontrollera-använt-utrymme läge '%s'

source: unknown raid level for command 'raid'
sv: okänd raidnivå för kommandot 'raid'

source: use probed instead of staging devicegraph
sv: använd sonderad i stället för iscensättande enhetsgraf

source: value for '%s' neither string nor array
sv: värde för '%s' varken sträng eller array

source: value of description entry not a string
sv: värdet för beskrivningsinmatningen är inte en sträng

source: value of devices entry not an array
sv: värdet av enhetsposten är inte en array

source: volume group '%s' is over-committed
sv: volymgrupp '%s' är överengagerad

source: wrong number of partitionables
sv: fel antal partitionerbara enheter

source: y
sv: j
